html/11_Parallel_Computing.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>11. Parallel Computing</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="11. Parallel Computing"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="fall 2013"/>
<meta name="author" content="Paul Gribble"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="mystyle.css" /></head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="http://www.gribblelab.org/scicomp/index.html"> UP </a>
 |
 <a accesskey="H" href="http://www.gribblelab.org/scicomp/index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">11. Parallel Computing</h1>



<hr/>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 What is parallel computing?</a></li>
<li><a href="#sec-2">2 Multi-threading</a></li>
<li><a href="#sec-3">3 Symmetric Multiprocessing (SMP)</a></li>
<li><a href="#sec-4">4 Hyperthreading</a></li>
<li><a href="#sec-5">5 Clusters</a></li>
<li><a href="#sec-6">6 Grids</a></li>
<li><a href="#sec-7">7 GPU Computing</a></li>
<li><a href="#sec-8">8 Types of Parallel problems</a></li>
<li><a href="#sec-9">9 MATLAB</a></li>
<li><a href="#sec-10">10 Python / IPython</a></li>
<li><a href="#sec-11">11 R</a></li>
<li><a href="#sec-12">12 C</a></li>
<li><a href="#sec-13">13 Shell scripts</a></li>
<li><a href="#sec-14">14 Exercises</a></li>
</ul>
</div>
</div>

<hr/>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is parallel computing?</h2>
<div class="outline-text-2" id="text-1">


<p>
Simply put, parallel computing refers to performing multiple computations in <b>parallel</b>, i.e. simultaneously. By default most operations that take place on your computer happen in <b>serial</b>, that is, one at a time. These days CPU chips (even those on laptops) have multiple cores, which allow for some degree of parallel operations.
</p>
<p>
In principle, every time you double the number of CPU cores (or CPUs themselves), you can achieve something close to a halving of time to complete the operations. In practice however, there is always some overhead cost in carryout out the parallel computations. If the operations are at all lengthy however, the overhead cost is always worth it.
</p>
<p>
There are several types of parallel computing, which we'll talk briefly about (and which are listed below). What we'll get hands-on experience with is symmetric multiprocessing. This is the style of parallel computing where multiple CPUs, or multiple cores on a single CPU, share access to the same memory (RAM) store, and can carry out operations in parallel.
</p>
<p>
Today (Fall, 2013), it's still the case that not many programs take advantage of multiple cores. Operating systems, however, can take advantage of multiple cores through multithreading (see below), by assigning different threads to their own processing nodes.
</p>
<p>
Some programs like MATLAB (and some Apple applications) come with the ability to take advantage of multiple cores built-in. Due to the relative complexity of parallelizing serial code, however, most applications still operate in a serial fashion.
</p>
<p>
<a href="http://en.wikipedia.org/wiki/Parallel_computing">Parallel computing</a> (Wikipedia)
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Multi-threading</h2>
<div class="outline-text-2" id="text-2">


<p>
Modern operating systems like Mac OSX, Linux, and other Unix variants, provide the ability for programs to spawn multiple threads that execute independently of each other. Windows may have this as well, I have no idea. The advantage of multithreading is that one process can do its work and other processes don't have to wait until the working process is done. This is used extensively for graphical user interfaces.
</p>
<p>
When you copy a file, you can still move your mouse around, you can still start other programs, you can still browse the web, while other things are happening simultaneously. Multithreading can occur on a single CPU with a single core. This isn't parallel computing per se, as multiple threads still have to share a single CPU processing unit to do their work &hellip; but the operating system manages the multiple threads so that the user has the impression that multiple things are happening at once.
</p>
<p>
See the wikipedia article for more details:
</p>
<p>
<a href="http://en.wikipedia.org/wiki/Multithreading_(computer_architecture)">Multithreading</a> (wikipedia)
</p>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Symmetric Multiprocessing (SMP)</h2>
<div class="outline-text-2" id="text-3">


<p>
These days modern computers ship with CPUs that have multiple cores, or even multiple CPUs each with multiple cores. At the time of writing these notes (Fall 2013) you can for example buy a Mac Pro desktop computer with two 6-core CPUs, for a total of 12 independent processing cores. With hyperthreading (see below) you get 24 processing cores, all for around $5,000 &mdash; which seems like a lot, but just 10 years ago a computer cluster with 24 nodes would have cost around $75,000 - $100,000.
</p>
<p>
When multiple CPUs and/or multiple CPU cores live in a single machine, they typically all share access to the same physical RAM (memory). These days all Apple desktops and laptops have CPUs with multiple cores. Generic PCs also ship with multiple CPUs and cores. Even smartphones (e.g. the iPhone, and Google's Nexus 5) come with multiple CPUs and multiple cores.
</p>
<p>
The great advantage of having multiple computing nodes in a single machine, is that unlike multithreading on a single CPU, where the operating system has to switch back and forth between each thread, with multiple CPUs/cores, each core can execute a different task in parallel with the others (i.e. at the same time).
</p>
<p>
A good analogy is the following. Imagine someone gives me 10 decks of playing cards, and each deck has been shuffled, and my task is to re-order each deck of cards. A computer with a single CPU/core is like a single person who is tasked with sorting all 10 decks of cards. I would have to sort them all, one at a time, one after the other, i.e. in serial. I could implement "multithreading" by sorting one deck for a few seconds, setting it aside, sorting the next deck for a few seconds, setting it aside, and so on, sorting bits of each one, one by one. It's still happening in serial though.
</p>
<p>
If I had access to other processing nodes, I could parallelize the task. So imagine instead of me sorting all 10 decks, I found 9 other people to help me. I gave them one of the 10 decks of cards, and I took one. Now we can all sort them, at the same time, in parallel. In theory it should take \(\frac{1}{10}^{\mathrm{th}}\) the time compared to me sorting them all myself, in serial. In fact though, there would be some overhead cost, for example at the beginning, when I would have to hand out each deck and give everyone their instructions, and then at the end, when I would have to collect all the sorted decks from each person. If the actual computational task being parallelized is time intensive, however, then these overhead costs would be minimal compared to the gain in speed I would achieve by parallelizing the task.
</p>
<p>
Symmetric multiprocessing, i.e. having multiple independent processing units share the same memory store, is advantageous compared to cluster or grid computing, where each processing node has its own memory. In the latter cases, there is a (sometimes relatively major) overhead cost involved in transferring data to the memory store for each processing unit, and back again to a head node. When this transfer happens over a network, as you can imagine, this would be way slower than if it happens on a common logic board on which all processing cores sit (as is with the case of symmetric multiprocessing).
</p>
<p>
Here is a wikipedia article on symmetric multiprocessing:
</p>
<p>
<a href="http://en.wikipedia.org/wiki/Symmetric_multiprocessing">Symmetric multiprocessing</a> (wikipedia)
</p>

</div>

</div>
