org/11_Parallel_Computing.org
* Hyperthreading

Hyperthreading is a proprietary implementation by Intel for allowing modern CPUs to behave as if they have twice as many logical cores as physical cores. That is, if your CPU has two cores, hyperthreading implements a series of tricks at the operating system level, that interface with a series of tricks at the hardware layer (i.e. in the CPU itself) that results in the ability to address four "logical" cores.

Unlike multithreading, which is simply a software implementation at the operating system level, hyperthreading involves special implementations both at the operating system level and at the hardware level. Current Apple laptops and desktops all implement hyperthreading. Several generic PCs also implement hyperthreading.

For large, time consuming computations, hyperthreading won't actually double the computation speed, since at the end of the day, there are still $x$ physical cores, even though hyperthreading pretends there are $2x$ logical cores. If however each computations is small, and doesn't last a long time, hyperthreading can end up giving you performance gains above and beyond regular multithreading, since it implements a number of efficiencies and tricks at the software and hardware layers.

For our purposes, hyperthreading is either there, or it isn't, and it's not something we will be fiddling with. Here is a wikipedia article on hyperthreading:

[[http://en.wikipedia.org/wiki/Hyper-threading][Hyper-threading]] (wikipedia)


* Clusters

So far we have been talking about a single machine with multiple CPUs and/or multiple cores. Another way of implementing parallel computing is to connect together multiple machines, over a specialized local network. In principle one can connect as many machines as one likes, to achieve just about any level of parallelism one wants. Today's fastest [[http://en.wikipedia.org/wiki/Supercomputer][supercomputers]] are in fact clusters of machines hooked together. The world's fastest supercomputer, as of November 2013, is the [[http://en.wikipedia.org/wiki/Tianhe-2][Tianhe-2]], located in Guangzhou, China. It has 16,000 computer nodes, each one comprising two Intel Ivy Bridge Xeon CPUs and three Xeon Phi chips for a total of 3,120,000 cores (3.12 million cores).

[[https://www.sharcnet.ca/my/front/][Sharcnet]] is a Canadian cluster computing facility with several individual clusters, the largest of which has 8,320 cores. I believe Western has access to the Sharcnet clusters, but there is a cost associated with running jobs.

Many individual researchers also operate smaller clusters, for example with 8, or 12, or 24 machines hooked together. 

A relatively recent development is the advent of gigantic server farms operated by private companies like Amazon and Google. Amazon's [[http://aws.amazon.com/ec2/][Elastic Compute Cloud]] allows individuals to spawn multiple "virtual" machines, and hook them together in networks and clusters, and run jobs on them. Cost is per machine and per unit time, and so one can essentially (1) define your own cluster and (2) pay for only those minutes that you actually use. It's a very flexible system that many researchers are beginning to utilize. Rhodri Cusack's lab, for example, uses cloud-based machines for brain imaging data analysis.

The obvious advantage of a cluster over a single SMP machine, is that one can add as many nodes onto the cluster (growing it as you go) to whatever size you want (provided you can pay for it). The disadvantage is that data transfer over a network can be slower than a SMP machine where CPU cores share the same RAM store. There is also added complexity in managing a cluster of machines, for example in configuring each one, and configuring a head node to manage all of the slave nodes. There is software out there that can organize this for you, for example [[http://en.wikipedia.org/wiki/Oracle_Grid_Engine][Oracle Grid Engine]], and others, but it's still not trivial and takes some investment of time to fully implement.

[[http://en.wikipedia.org/wiki/Cluster_(computing)][Computer cluster]] (wikipedia)


* Grids

A grid is like a cluster, but the individual machines are not on a local network, but they can be anywhere on the internet. Sometimes multiple clusters are hooked together over the internet to form a grid. Sometimes a grid is composed of multiple individual machines, spread out over multiple labs, multiple Departments, Univerisities, or even countries. Sometimes grids are set up so that individual machines can be "taken over" as dedicated computational nodes. In other configurations, individual machines only process grid jobs during their downtime, when for example the user is not using the machine for something else. One way of setting this up is via a specialized screensaver. Wheneven the screensaver activates (which is an indication that the machine is not being used), the grid process starts up and processes grid jobs.

Two classic examples of grids are the [[http://en.wikipedia.org/wiki/SETI@Home][SETI@home]] grid (searching for extra-terrestrial life in the universe) and the [[http://en.wikipedia.org/wiki/Folding@home][Folding@home]] grid (simulations of protein folding for disease research). In each case, anyone around the world can sign up their machine to join the grid and donate computer time, install some local software, and then anytime their computer is not busy, it is recruited by the grid to process data. As of now (Nov 2013) the Folding@home website shows that there are 6,255,076 CPUs active right now on the Folding@home grid.

There are also nefarious uses for grids, which are sometimes called [[http://en.wikipedia.org/wiki/Botnet][Botnet]]s. In this case, a virus infects a user's machine, installs a nefarious program, which lies dormant until a central machine somewhere on the internet activates it, for some nasty purpose (like a [[http://en.wikipedia.org/wiki/Distributed_denial-of-service_attack#Distributed_attack][DDoS attack]], or for sending spam). Your machine essentially becomes a sleeper cell.

[[http://en.wikipedia.org/wiki/Grid_computing][Grid computing]] (wikipedia)

