org/11_Parallel_Computing.org
* GPU Computing

In recent years computer engineers and software developers have teamed up, and have delivered software libraries that allow developers to utilize graphics cards for more general purpose computing (GPGPU Computing).

Graphics cards, unlike CPUs, have hundreds if not thousands of cores, each of which are typically used to process graphics for things like 3D games, video animation and scientific visualization. Each processing unit on a graphics card is a much simpler beast than the cores on CPU chips ... but for some computational tasks, one doesn't need much complexity, and massive parallelism can be achieved by farming out general purpose computational tasks to the thousands of cores on a graphics card.

For example, today (Nov 2013) for around $5,000 one can purchase an [[http://www.nvidia.com/object/tesla-workstations.html][NVidia Tesla GPU]], which is a single graphics card, that has 12GB of GPU memory, 2880 cores, and has a processing power of 1.43 Tflops. As you can imagine, if your computational task is well suited to GPU processing, running it on 2880 cores will be quite a bit faster than running on 4, 8 or 12 cores (e.g. that you get with a modern dual 6-core CPU Mac Pro).

There are two major C/C++ software libraries that provide relatively high-level interfaces to performing general purpose computation on graphics cards

- [[http://www.nvidia.com/object/cuda_home_new.html][CUDA]] (Nvidia proprietary)
- [[http://www.khronos.org/opencl/][OpenCL]] (open)

MATLAB's Parallel Computing Toolbox has the ability to farm out some computations to NVidia CUDA-enabled GPUs, see this page for more info:

[[http://www.mathworks.com/discovery/matlab-gpu.html][MATLAB GPU Computing Support for NVIDIA CUDA-Enabled GPUs]]

For Python, there are libraries that let you access both the CUDA and OpenCL APIs:

- [[http://mathema.tician.de/software/pycuda/][PyCUDA]]
- [[http://mathema.tician.de/software/pyopencl/][PyOpenCL]]

For R, see the CRAN Task View for [[http://cran.r-project.org/web/views/HighPerformanceComputing.html][High-Performance and Parallel Computing with R]] which has a section on "Parallel Computing: GPUs". There are several libraries including [[http://cran.r-project.org/web/packages/gputools/index.html][gputools]], [[http://cran.r-project.org/web/packages/OpenCL/index.html][OpenCL]], and others.

See this wikipedia page for more general information on GPGPU Computing:

[[http://en.wikipedia.org/wiki/General-purpose_computing_on_graphics_processing_units][GPGPU Computing]]


* Types of Parallel problems

Multithreading is an example of *fine-grained parallelism* (many shared operations per second), in which the operating system manages (e.g. switches between) threads at a very fast rate, e.g. with each CPU clock cycle. This can thus happen many times per second. This is what your operating system does in the background, as you are interacting with your graphical user interface, surfing the web, playing music, processing video in the background, all the while copying files from one disk to another.

In another kind of fine-grained parallelism, multiple processes communicate with each other many, many times per second.

In *coarse-grained parallelism*, there are many, many independent threads/tasks, that rarely or never communicate with each other.

Finally, so-called *embarassingly parallel* problems are 100% independent operations, and never communicate with each other. Each process doesn't depend in any way on the result of another operation. This is the kind of parallelism that we will be talking about in this class.

* MATLAB

MATLAB provides parallel computing via its Parallel Computing Toolbox (see below).

- [[http://www.mathworks.com/products/parallel-computing/][MATLAB Parallel Computing Toolbox]]
- [[http://www.mathworks.com/help/distcomp/parfor.html][MATLAB Execute loop iterations in parallel using parfor]]
- [[http://www.mathworks.com/help/distcomp/getting-started-with-parfor.html][MATLAB Getting Started with parfor]]
- [[http://www.mathworks.com/help/distcomp/examples/][MATLAB Parallel Computing Toolbox Examples]]


* Python / IPython

In Python, there are several parallel computing libraries, but one that you should look at first, I suggest, is the library built into IPython, which enables relatively easy parallelism both within a multi-core machine and even across multiple machines on a network.

- [[https://wiki.python.org/moin/ParallelProcessing][Parallel Processing and Multiprocessing in Python]]
- [[http://ipython.org/ipython-doc/dev/parallel/][Using IPython for parallel computing]]


* R

For R there are several libraries, see the page below. I suggest having a look at the "foreach" package (you will have to install it) and possibly the "doMC" package (again, install it) and the "multicore" package (yes you will have to install it!).

- [[http://cran.r-project.org/web/views/HighPerformanceComputing.html][High-Performance and Parallel Computing with R]]
- [[http://www.r-bloggers.com/the-wonders-of-foreach/][The Wonders of foreach]] (R news & tutorials)
- [[http://cran.r-project.org/web/packages/doMC/vignettes/gettingstartedMC.pdf][Getting Started with doMC and foreach]]
- [[http://cran.r-project.org/web/packages/foreach/index.html][CRAN Package foreach]]
- [[http://www.r-bloggers.com/r-parallel-processing-using-multicore-package-2/][R: parallel processing using multicore package]]

* C

In C there are many options for implementing parallel computing, ranging from relatively easy (OpenMP) to more difficult (pthreads), to completely flexible (MPI). See the page on parallel programming in C from the C Boot Camp for more info. My suggestion is to start with OpenMP, especially for embarrassingly parallel problems.

- [[http://www.gribblelab.org/CBootcamp/A2_Parallel_Programming_in_C.html][Parallel Programming in C]]
- [[http://openmp.org/wp/][OpenMP]]
- [[https://computing.llnl.gov/tutorials/openMP/][OpenMP tutorial]]
- [[http://openmp.org/mp-documents/omp-hands-on-SC08.pdf][A "Hands-on" Introduction to OpenMP]]


* Shell scripts

Finally, one can parallelize tasks at the level of the shell, even if the programs you write/run aren't parallelized, using a tool like GNU Parallel (see below). Briefly, with GNU Parallel you can split a list of (ambarassingly parallel) tasks across multiple cores even if the program itself is serial in nature. See the GNU Parallel page below and the tutorial page for some examples. In our lab we use GNU Parallel to distribute subject-level brain imaging processing across multiple cores.

- [[http://www.gnu.org/software/parallel/][GNU Parallel]]
- [[http://www.gnu.org/software/parallel/parallel_tutorial.html][GNU Parallel tutorial]]


