html/11_Parallel_Computing.html

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> GPU Computing</h2>
<div class="outline-text-2" id="text-7">


<p>
In recent years computer engineers and software developers have teamed up, and have delivered software libraries that allow developers to utilize graphics cards for more general purpose computing (GPGPU Computing).
</p>
<p>
Graphics cards, unlike CPUs, have hundreds if not thousands of cores, each of which are typically used to process graphics for things like 3D games, video animation and scientific visualization. Each processing unit on a graphics card is a much simpler beast than the cores on CPU chips &hellip; but for some computational tasks, one doesn't need much complexity, and massive parallelism can be achieved by farming out general purpose computational tasks to the thousands of cores on a graphics card.
</p>
<p>
For example, today (Nov 2013) for around $5,000 one can purchase an <a href="http://www.nvidia.com/object/tesla-workstations.html">NVidia Tesla GPU</a>, which is a single graphics card, that has 12GB of GPU memory, 2880 cores, and has a processing power of 1.43 Tflops. As you can imagine, if your computational task is well suited to GPU processing, running it on 2880 cores will be quite a bit faster than running on 4, 8 or 12 cores (e.g. that you get with a modern dual 6-core CPU Mac Pro).
</p>
<p>
There are two major C/C++ software libraries that provide relatively high-level interfaces to performing general purpose computation on graphics cards
</p>
<ul>
<li><a href="http://www.nvidia.com/object/cuda_home_new.html">CUDA</a> (Nvidia proprietary)
</li>
<li><a href="http://www.khronos.org/opencl/">OpenCL</a> (open)
</li>
</ul>


<p>
MATLAB's Parallel Computing Toolbox has the ability to farm out some computations to NVidia CUDA-enabled GPUs, see this page for more info:
</p>
<p>
<a href="http://www.mathworks.com/discovery/matlab-gpu.html">MATLAB GPU Computing Support for NVIDIA CUDA-Enabled GPUs</a>
</p>
<p>
For Python, there are libraries that let you access both the CUDA and OpenCL APIs:
</p>
<ul>
<li><a href="http://mathema.tician.de/software/pycuda/">PyCUDA</a>
</li>
<li><a href="http://mathema.tician.de/software/pyopencl/">PyOpenCL</a>
</li>
</ul>


<p>
For R, see the CRAN Task View for <a href="http://cran.r-project.org/web/views/HighPerformanceComputing.html">High-Performance and Parallel Computing with R</a> which has a section on "Parallel Computing: GPUs". There are several libraries including <a href="http://cran.r-project.org/web/packages/gputools/index.html">gputools</a>, <a href="http://cran.r-project.org/web/packages/OpenCL/index.html">OpenCL</a>, and others.
</p>
<p>
See this wikipedia page for more general information on GPGPU Computing:
</p>
<p>
<a href="http://en.wikipedia.org/wiki/General-purpose_computing_on_graphics_processing_units">GPGPU Computing</a>
</p>

</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Types of Parallel problems</h2>
<div class="outline-text-2" id="text-8">


<p>
Multithreading is an example of <b>fine-grained parallelism</b> (many shared operations per second), in which the operating system manages (e.g. switches between) threads at a very fast rate, e.g. with each CPU clock cycle. This can thus happen many times per second. This is what your operating system does in the background, as you are interacting with your graphical user interface, surfing the web, playing music, processing video in the background, all the while copying files from one disk to another.
</p>
<p>
In another kind of fine-grained parallelism, multiple processes communicate with each other many, many times per second.
</p>
<p>
In <b>coarse-grained parallelism</b>, there are many, many independent threads/tasks, that rarely or never communicate with each other.
</p>
<p>
Finally, so-called <b>embarassingly parallel</b> problems are 100% independent operations, and never communicate with each other. Each process doesn't depend in any way on the result of another operation. This is the kind of parallelism that we will be talking about in this class.
</p>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> MATLAB</h2>
<div class="outline-text-2" id="text-9">


<p>
MATLAB provides parallel computing via its Parallel Computing Toolbox (see below).
</p>
<ul>
<li><a href="http://www.mathworks.com/products/parallel-computing/">MATLAB Parallel Computing Toolbox</a>
</li>
<li><a href="http://www.mathworks.com/help/distcomp/parfor.html">MATLAB Execute loop iterations in parallel using parfor</a>
</li>
<li><a href="http://www.mathworks.com/help/distcomp/getting-started-with-parfor.html">MATLAB Getting Started with parfor</a>
</li>
<li><a href="http://www.mathworks.com/help/distcomp/examples/">MATLAB Parallel Computing Toolbox Examples</a>
</li>
</ul>



</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Python / IPython</h2>
<div class="outline-text-2" id="text-10">


<p>
In Python, there are several parallel computing libraries, but one that you should look at first, I suggest, is the library built into IPython, which enables relatively easy parallelism both within a multi-core machine and even across multiple machines on a network.
</p>
<ul>
<li><a href="https://wiki.python.org/moin/ParallelProcessing">Parallel Processing and Multiprocessing in Python</a>
</li>
<li><a href="http://ipython.org/ipython-doc/dev/parallel/">Using IPython for parallel computing</a>
</li>
</ul>



</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> R</h2>
<div class="outline-text-2" id="text-11">


<p>
For R there are several libraries, see the page below. I suggest having a look at the "foreach" package (you will have to install it) and possibly the "doMC" package (again, install it) and the "multicore" package (yes you will have to install it!).
</p>
<ul>
<li><a href="http://cran.r-project.org/web/views/HighPerformanceComputing.html">High-Performance and Parallel Computing with R</a>
</li>
<li><a href="http://www.r-bloggers.com/the-wonders-of-foreach/">The Wonders of foreach</a> (R news &amp; tutorials)
</li>
<li><a href="http://cran.r-project.org/web/packages/doMC/vignettes/gettingstartedMC.pdf">Getting Started with doMC and foreach</a>
</li>
<li><a href="http://cran.r-project.org/web/packages/foreach/index.html">CRAN Package foreach</a>
</li>
<li><a href="http://www.r-bloggers.com/r-parallel-processing-using-multicore-package-2/">R: parallel processing using multicore package</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> C</h2>
<div class="outline-text-2" id="text-12">


<p>
In C there are many options for implementing parallel computing, ranging from relatively easy (OpenMP) to more difficult (pthreads), to completely flexible (MPI). See the page on parallel programming in C from the C Boot Camp for more info. My suggestion is to start with OpenMP, especially for embarrassingly parallel problems.
</p>
<ul>
<li><a href="http://www.gribblelab.org/CBootcamp/A2_Parallel_Programming_in_C.html">Parallel Programming in C</a>
</li>
<li><a href="http://openmp.org/wp/">OpenMP</a>
</li>
<li><a href="https://computing.llnl.gov/tutorials/openMP/">OpenMP tutorial</a>
</li>
<li><a href="http://openmp.org/mp-documents/omp-hands-on-SC08.pdf">A "Hands-on" Introduction to OpenMP</a>
</li>
</ul>



</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Shell scripts</h2>
<div class="outline-text-2" id="text-13">


<p>
Finally, one can parallelize tasks at the level of the shell, even if the programs you write/run aren't parallelized, using a tool like GNU Parallel (see below). Briefly, with GNU Parallel you can split a list of (ambarassingly parallel) tasks across multiple cores even if the program itself is serial in nature. See the GNU Parallel page below and the tutorial page for some examples. In our lab we use GNU Parallel to distribute subject-level brain imaging processing across multiple cores.
</p>
<ul>
<li><a href="http://www.gnu.org/software/parallel/">GNU Parallel</a>
</li>
<li><a href="http://www.gnu.org/software/parallel/parallel_tutorial.html">GNU Parallel tutorial</a>
</li>
</ul>



</div>

</div>
